<?php
require_once __DIR__ . '/header.php'
?>
    <h1>I can speak<h1>
    <h4>太宰治</h4>
    <button id="speedUpButton">速くする</button>
    <button id="speedDownButton">遅くする</button>
    <button id="resetSpeedButton">元に戻す</button>
    <button id="increaseFontSizeButton">フォントサイズを大きく</button>
    <button id="decreaseFontSizeButton">フォントサイズを小さく</button>
    <br>
    <br>
    <button id="prevButton">前項</button>
    <button id="displayButton">次項</button>
    <div id="output"></div>
    <audio id="audioPlayer" controls>
        <source src="i1.mp3" type="audio/mp3">
    </audio>
    <style>
  /* 音声フォームを非表示にするスタイル */
  #audioPlayer {
    display: none;
  }
</style>
<script>
    var stringArray = [
            "くるしさは、忍従の夜。あきらめの朝。この世とは、あきらめの努めか。わびしさの堪えか。わかさ、かくて、日に虫食われゆき、仕合せも、陋巷《ろうこう》の内に、見つけし、となむ。",
        "わが歌、声を失い、しばらく東京で無為徒食して、そのうちに、何か、歌でなく、謂《い》わば「生活のつぶやき」とでもいったようなものを、ぼそぼそ書きはじめて、",
        "自分の文学のすすむべき路《みち》すこしずつ、そのおのれの作品に依って知らされ、ま、こんなところかな？",
        "と多少、自信に似たものを得て、まえから腹案していた長い小説に取りかかった。",
        "昨年、九月、甲州の御坂《みさか》峠頂上の天下茶屋という茶店の二階を借りて、そこで少しずつ、その仕事をすすめて、どうやら百枚ちかくなって、読みかえしてみても、そんなに悪い出来ではない。",
        "あたらしく力を得て、とにかくこれを完成させぬうちは、東京へ帰るまい、と御坂《みさか》の木枯《こがらし》つよい日に、勝手にひとりで約束した。",
        "ばかな約束をしたものである。九月、十月、十一月、御坂の寒気堪えがたくなった。あのころは、心細い夜がつづいた。どうしようかと、さんざ迷った。",
        "自分で勝手に、自分に約束して、いまさら、それを破れず、東京へ飛んで帰りたくても、何かそれは破戒のような気がして、峠のうえで、途方に暮れた。",
        "甲府へ降りようと思った。甲府なら、東京よりも温いほどで、この冬も大丈夫すごせると思った。",
        "甲府へ降りた。たすかった。変なせきが出なくなった。甲府のまちはずれの下宿屋、日当りのいい一部屋かりて、机にむかって坐ってみて、よかったと思った。",
        "また、少しずつ仕事をすすめた。おひるごろから、ひとりでぼそぼそ仕事をしていると、わかい女の合唱が聞えて来る。私はペンを休めて、耳傾ける。",
        "下宿と小路ひとつ距《へだ》て製糸工場が在るのだ。そこの女工さんたちが、作業しながら、唄うのだ。なかにひとつ、際立っていい声が在って、そいつがリイドして唄うのだ。",
        "鶏群の一鶴《いっかく》、そんな感じだ。いい声だな、と思う。お礼を言いたいとさえ思った。工場の塀《へい》をよじのぼって、その声の主を、ひとめ見たいとさえ思った。",
        "ここにひとり、わびしい男がいて、毎日毎日あなたの唄で、どんなに救われているかわからない、あなたは、それをご存じない、",
        "あなたは私を、私の仕事を、どんなに、けなげに、はげまして呉《く》れたか、私は、しんからお礼を言いたい。そんなことを書き散らして、工場の窓から、投文《なげぶみ》しようかとも思った。",
        "けれども、そんなことして、あの女工さん、おどろき、おそれてふっと声を失ったら、これは困る。無心の唄を、私のお礼が、かえって濁らせるようなことがあっては、罪悪である。",
        "私は、ひとりでやきもきしていた。恋、かも知れなかった。二月、寒いしずかな夜である。工場の小路で、酔漢の荒い言葉が、突然起った。私は、耳をすました。",
        "――ば、ばかにするなよ。何がおかしいんだ。たまに酒を呑んだからって、おらあ笑われるような覚えは無《ね》え。",
        "I can speak English. おれは、夜学へ行ってんだよ。姉さん知ってるかい？ 知らねえだろう。おふくろにも内緒で、こっそり夜学へかよっているんだ。",
        "偉くならなければ、いけないからな。姉さん、何がおかしいんだ。何を、そんなに笑うんだ。こう、姉さん。おらあな、いまに出征するんだ。",
        "そのときは、おどろくなよ。のんだくれの弟だって、人なみの働きはできるさ。嘘だよ、まだ出征とは、きまってねえのだ。だけども、さ、",
        "I can speak English. Can you speak English? Yes, I can. いいなあ、英語って奴は。姉さん、はっきり言って呉れ、おらあ、いい子だな、な、いい子だろう？ ",
        "おふくろなんて、なんにも判りゃしないのだ。……私は、障子を少しあけて、小路を見おろす。はじめ、白梅かと思った。ちがった。その弟の白いレンコオトだった。",
        "季節はずれのそのレンコオトを着て、弟は寒そうに、工場の塀にひたと脊中《せなか》をくっつけて立っていて、その塀の上の、工場の窓から、",
        "ひとりの女工さんが、上半身乗り出し、酔った弟を、見つめている。月が出ていたけれど、その弟の顔も、女工さんの顔も、はっきりとは見えなかった。",
        "姉の顔は、まるく、ほの白く、笑っているようである。弟の顔は、黒く、まだ幼い感じであった。I can speak というその酔漢の英語が、くるしいくらい私を撃った。",
        "はじめに言葉ありき。よろずのもの、これに拠りて成る。ふっと私は、忘れた歌を思い出したような気がした。たあいない風景ではあったが、けれども、私には忘れがたい。",
        "あの夜の女工さんは、あのいい声のひとであるか、どうかは、それは、知らない。ちがうだろうね。",
        "最後のページです"
        ]
        
        const audioFiles = [
            "i can/i1.mp3",
            "i can/i2.mp3",
            "i can/i3.mp3",
            "i can/i4.mp3",
            "i can/i5.mp3",
            "i can/i6.mp3",
            "i can/i7.mp3",
            "i can/i8.mp3",
            "i can/i9.mp3",
            "i can/i10.mp3",
            "i can/i11.mp3",
            "i can/i12.mp3",
            "i can/i13.mp3",
            "i can/i14.mp3",
            "i can/i15.mp3",
            "i can/i16.mp3",
            "i can/i17.mp3",
            "i can/i18.mp3",
            "i can/i19.mp3",
            "i can/i20.mp3",
            "i can/i21.mp3",
            "i can/i22.mp3",
            "i can/i23.mp3",
            "i can/i24.mp3",
            "i can/i25.mp3",
            "i can/i26.mp3",
            "i can/i27.mp3",
            "i can/i28.mp3",
            "last.mp3",
        ];
</script>


<?php
require_once __DIR__ . '/footer.php'
?>